# Data Frame

In [3]:
import pandas as pd

df = pd.read_csv('data01.csv')

df

   id            name  age                       email
0   1        John Doe   28        john.doe@example.com
1   2      Jane Smith   34      jane.smith@example.com
2   3     Bob Johnson   45     bob.johnson@example.com
3   4  Alice Williams   23  alice.williams@example.com
4   5   Michael Brown   37   michael.brown@example.com

In [13]:
import pandas as pd

# Creating a DataFrame from a dictionary
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 28],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}

df = pd.DataFrame(data)

df
# df.loc[1:3]
# df.iloc[0,1]

# print(df)

# print(df[['Name', 'Age']])

# print(df[1:3])

# print(df['Age'].unique())

# print(df[df['Age'] > 25])

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

# Series

In [13]:
import pandas as pd

data = [1,2,3,4,5]
s = pd.Series(data)

print(s)
print(s[0])
print(s.iloc[0])
print('range')
print(s[1:4])

s.values
s.mean()
s.apply(lambda x: x**2)

0    1
1    2
2    3
3    4
4    5
dtype: int64
1
1
range
1    2
2    3
3    4
dtype: int64

0     1
1     4
2     9
3    16
4    25
dtype: int64